In [1]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
import matplotlib
matplotlib.rcParams['font.family']='Malgun Gothic'
matplotlib.rcParams['axes.unicode_minus'] = False

In [5]:
birthDF = pd.read_csv( 'data/births.txt', header=None,index_col=0)
birthDF.columns = ['boys','girls']
birthDF.index.name ='year'
birthDF

         boys    girls
year
1880    90993   110491
1881    91954   100745
1882   107850   113688
1883   112321   104629
1884   129022   114445
...       ...      ...
2007  1919408  2072139
2008  1887234  2036289
2009  1832925  1979303
2010  1772738  1913851
2011  1753500  1893230

[132 rows x 2 columns]

In [ ]:
1.남아수 총합을 구하시요
2.여아수 평균을 구하시요
3.남아수가 가장많은 년도와
남아수를 구하시요
4.2000년도 이후 데이터를
구하시요
5. 1995~ 2000 년도 데이터를
구하시요

In [8]:
#1.남아수 총합을 구하시요
# birthDF["boys"].sum()
birthDF.sum()['boys']

161802441

In [11]:
#2.여아수 평균을 구하시요
# birthDF['girls'].mean()
birthDF.mean()['boys']

1225776.0681818181

In [18]:
#3. 남아수가 가장많은 년도와 남아수를 구하시요
# print(birthDF['boys'].max())
# print(birthDF['boys'].idxmax())
# birthDF['boys'].nlargest(1, keep='all')
# birthDF[  birthDF['boys'] == birthDF['boys'].max() ]['boys']
# birthDF.sort_values('boys').iloc[-1]['boys']
m = birthDF['boys'].max()
birthDF.query( f'boys=={m}')['boys']

year
1957    2044160
Name: boys, dtype: int64

In [21]:
#4.2000년도 이후 데이터를 구하시요
# birthDF.query('year>=2000')
birthDF.loc[ 2000: ]

         boys    girls
year
2000  1814601  1962406
2001  1799049  1941251
2002  1795206  1939815
2003  1825359  1973434
2004  1834145  1982794
2005  1845379  1994841
2006  1898463  2052377
2007  1919408  2072139
2008  1887234  2036289
2009  1832925  1979303
2010  1772738  1913851
2011  1753500  1893230

In [22]:
#5. 1995~ 2000 년도 데이터를 구하시요
birthDF.loc[1995:2000] #birthDF.query('1995<=year<=2000')

         boys    girls
year
1995  1757927  1902832
1996  1752249  1893378
1997  1739806  1884122
1998  1765915  1910250
1999  1772632  1918809
2000  1814601  1962406

In [26]:
# 6. 남아출생이 가장많은 top5 를 구하시요(년도와 남아수)
birthDF.nlargest(5, 'boys',keep='all')[ ['boys'] ]

         boys
year
1957  2044160
1959  2023044
1960  2022093
1961  2017316
1958  2010884

In [27]:
# 7. 남아율(%) 컬럼을 추가하고 각년도별 남아수가 차지하는비율을 데이터로 보여주시요.
# birthDF['남아율(%)'] = birthDF.apply(lambda v: v['boys']/v.sum() * 100, axis=1)
# birthDF['boys']/(birthDF['boys']+birthDF['girls'])
birthDF['boys'] / birthDF.sum(axis=1)

year
1880    0.451614
1881    0.477190
1882    0.486824
1883    0.517728
1884    0.529936
          ...
2007    0.480868
2008    0.481005
2009    0.480802
2010    0.480861
2011    0.480842
Length: 132, dtype: float64

In [ ]:
8. 2000년도 이후데이터 에 대해
출생량 컬럼을 추가하고
남아수가 1800000 이상이면 '많음'아니면 '적음'
이라고 보여 주시요
	남아수 출생량
2000   1233   '많음'
2001   1234   '적음'

In [43]:
birthDF

         boys    girls
year
1880    90993   110491
1881    91954   100745
1882   107850   113688
1883   112321   104629
1884   129022   114445
...       ...      ...
2007  1919408  2072139
2008  1887234  2036289
2009  1832925  1979303
2010  1772738  1913851
2011  1753500  1893230

[132 rows x 2 columns]

In [42]:
# birthDF['출생량'] = birthDF.loc[2000:].apply(lambda v: '많음' if v['boys']>=1800000 else '적음', axis=1)
birth2000 = birthDF.loc[2000:]
birth2000['출생량'] =birth2000['boys'].apply( lambda v:'많음' if v>=1800000 else '적음' )
birth2000

<ipython-input-42-2d5f2cc2e997>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  birth2000['출생량'] =birth2000['boys'].apply( lambda v:'많음' if v>=1800000 else '적음' )

         boys    girls 출생량
year
2000  1814601  1962406  많음
2001  1799049  1941251  적음
2002  1795206  1939815  적음
2003  1825359  1973434  많음
2004  1834145  1982794  많음
2005  1845379  1994841  많음
2006  1898463  2052377  많음
2007  1919408  2072139  많음
2008  1887234  2036289  많음
2009  1832925  1979303  많음
2010  1772738  1913851  적음
2011  1753500  1893230  적음

In [ ]:
9.1800년대,1900년대,2000년대 각 남아,여야수 평균을 구하시요
birthDF.query('year//1800==1').mean()[['boys', 'girls']]
birthDF.query('year//1900==1').mean()[['boys', 'girls']]
birthDF.query('year//2000==1').mean()[['boys', 'girls']]

In [33]:
birthDF.loc[1800:1899].mean()

boys     176714.15
girls    111820.55
dtype: float64

In [35]:
birthDF.loc[1900:1999].mean()

boys     1362901.51
girls    1384145.55
dtype: float64

In [36]:
birthDF.loc[2000:].mean()

boys     1.831501e+06
girls    1.978478e+06
dtype: float64

In [ ]:
pip uninstall pandas
pip install pandas

In [ ]:
!pip uninstall pandas
!pip install pandas

In [40]:
data= [birthDF.loc[1800:1899].mean(),
       birthDF.loc[1900:1999].mean(),
       birthDF.loc[2000:].mean()  ] 
mydf = pd.DataFrame( data ,index=['1800년대평균','1900년대평균','2000년대평균'])
mydf.round(2).T

        1800년대평균    1900년대평균    2000년대평균
boys   176714.15  1362901.51  1831500.58
girls  111820.55  1384145.55  1978477.50

In [45]:
birthDF.query('(year%1800)<100')

        boys   girls
year
1880   90993  110491
1881   91954  100745
1882  107850  113688
1883  112321  104629
1884  129022  114445
1885  133055  107800
1886  144535  110784
1887  145982  101414
1888  178627  120853
1889  178366  110584
1890  190377  111025
1891  185482  101196
1892  212346  122037
1893  212906  112317
1894  222922  115772
1895  233630  117398
1896  237920  119570
1897  234202  112758
1898  258770  122693
1899  233023  106212

In [47]:
pd.__version__

'1.1.3'

In [48]:
# birthDF.query('(year//100)==18') //연산자X